 [
    {
        "title": "Mriya CRM",
        "image": "./images/mriya.png",
        "src": "",
        "technology": "Next.js, Type Script, React-hook-form, Redux, RTK-Juery, MaterialUA",
        "description": "CRM system for beauty salon Mriya: created an intuitive interface, implemented key components such as customer, employee, and service management. I optimised performance with Next.js, TypeScript, and Material-UI, ensuring stable operation of the system and integration with the Python and PostgreSQL backend"
        },
    {
        "title": "So Yummy",
        "image": "./images/so-yummy.png",
        "src": "https://vitalij99.github.io/recipes5/",
        "technology": "React, Redux, RESTful API, Node.js, Express, MongoDb, mongoose, jsonwebtoken",
        "description": "A team project for an application dedicated to creating and managing unique recipes. My role focused on backend development, particularly user authorization and registration using Express and MongoDB. The application includes features like a shopping list, ingredient calculations, and the ability to save and categorize favorite recipes, all managed via Redux."
        },
    {
        "title": "Ecosolutions",
        "image": "./images/Ecosolutions.png",
        "src": "https://kryzhanivskyi89.github.io/ecosolution/",
        "technology": "React, WebPack, Git, CSS, HTML",
        "description": "Pet project: A responsive landing page for a company specializing in alternative energy sources. I implemented a dynamic slider showcasing works, an energy meter, a feedback form, and a burger menu. This project emphasized the importance of user experience and responsive design."
    },
    {
        "title": "Movies",
        "image": "./images/movies.jpg",
        "src": "https://kryzhanivskyi89.github.io/goit-react-hw-05-movies/",
        "technology": "React Hooks · Webpack · React.js · JSON · Routing · npm · Axios",
        "description": "This project simplifies searching for and viewing movie information. Users can discover popular movies, search by various criteria, and view detailed movie pages. Developed a homepage for popular movies and a search page for individual movie details. Integrated web routing for smooth navigation and used hooks for state management. Conducted asynchronous fetch requests to retrieve movie data."
    },
    {
        "title": "Phonebook",
        "image": "./images/Phonebook.jpg",
        "src": "https://kryzhanivskyi89.github.io/goit-react-hw-08-phonebook/",
        "technology": "React Hooks · Webpack · Redux.js · React.js · JSON · Routing · npm · Material-UI · Express.js · MongoDB · Render",
        "description": "This project is a full-stack phonebook app for managing contacts. It features secure user authentication and authorization, contact management (add, edit, delete), and MongoDB integration. The app is deployed on a hosting platform, overcoming authorization challenges and ensuring consistent functionality. Input handling and data validation were optimized for a better user experience."
    },
    {
        "title": "News",
        "image": "./images/News.png",
        "src": " https://petrov-tech.github.io/team-project-news/",
        "technology": "Scrum · Agile Methodologies · JSON · npm · Figma (Software) · Trello · Axios · JavaScript · Cascading Style Sheets (CSS)",
        "description": "A frontend service that allows users to search for news from reputable sources based on queries, popular trends, and dates. The application includes functionality to save and categorize favorite and read articles, with a focus on user experience through light and dark themes, a weather widget, and a date display. I was responsible for implementing the logic for managing favorite articles."
    },
    {
        "title": "Foodsta",
        "image": "./images/FoodSta2x.png",
        "src": " https://petrov-tech.github.io/team13-proj-foodsta/",
        "technology": "Parcel · Git · Cascading Style Sheets (CSS) · Scrum · Agile Methodologies · HTML5 · JavaScript · Figma (Software) · Trello",
        "description": "Team project: website of a cafe where the most delicious food is prepared. Developed buttons and was responsible for the responsive header in the mobile-first layout. Helped colleagues in coding and solving difficulties with unfavourable deadlines. Effective communication via messengers and daily meetings."
    },
    {
        "title": "WebStudio",
        "image": "./images/web-studiia.jpeg",
        "src": "https://kryzhanivskyi89.github.io/goit-markup-hw-08/ ",
        "technology": "Git · Cascading Style Sheets (CSS) HTML5  · Figma (Software) ",
        "description": "Pet project: A personal project showcasing a landing page for a company offering IT solutions. The site features the company’s portfolio, team member profiles, unique selling points, and a newsletter subscription form. I focused on creating a visually appealing, adaptive layout that ensures an optimal user experience across all devices."
    }
   

]


